# pandas로 my_data.csv 수정하고 저장하기

pandas를 불러오고 my_data.csv를 읽어와 my_data변수에 저장

In [148]:
import pandas as pd

my_data = pd.read_csv("my_data.csv")

## 1. Unamed:0 열을 지우기
단 Unnamed:0라 쓰지말고 새롭게 컬럼 이름을 만들어서 지운다.

In [149]:
print(my_data.columns)
my_data.columns = ["index", "name", "age", "salary"]

my_data = my_data.drop("index", axis=1)
my_data

Index(['Unnamed: 0', 'name', 'age', 'salary'], dtype='object')

      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    james   30  400000
4    Alice   25   50000
5      Bob   30   60000
6  Charlie   35   70000
7    james   30  400000

## 2. name에 해당되는 영문 이름을 한글로 바꾸기

In [150]:
name_list = my_data["name"].tolist()
translate_name = {"Alice": "엘리스", "Bob": "밥", "Charlie": "찰리", "james": "제임스"}

name_list = [translate_name[i] for i in name_list]
my_data["name"] = name_list
my_data

  name  age  salary
0  엘리스   25   50000
1    밥   30   60000
2   찰리   35   70000
3  제임스   30  400000
4  엘리스   25   50000
5    밥   30   60000
6   찰리   35   70000
7  제임스   30  400000

## 3. salary에 해당되는 숫자를 세자리 단위로 콤마를 넣어서 값을 바꿔 넣기

In [151]:
salary_list = my_data["salary"].tolist()
salary_list = [format(i, ",") for i in salary_list]
my_data["salary"] = salary_list
my_data

  name  age   salary
0  엘리스   25   50,000
1    밥   30   60,000
2   찰리   35   70,000
3  제임스   30  400,000
4  엘리스   25   50,000
5    밥   30   60,000
6   찰리   35   70,000
7  제임스   30  400,000

## 4. 0,1,2,3,4로 보여지는 index부분 지우기

In [152]:
my_data.set_index("name", inplace=True)
my_data

      age   salary
name
엘리스    25   50,000
밥      30   60,000
찰리     35   70,000
제임스    30  400,000
엘리스    25   50,000
밥      30   60,000
찰리     35   70,000
제임스    30  400,000

## 5. csv파일로 저장하기

In [153]:
my_data.to_csv("new_my_data.csv")